tap "d12frosted/emacs-plus", trusted: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Secrets scanner built for configurability and speed
brew "betterleaks"
# Linter/analyzer for Makefiles
brew "checkmake"
# Cross-platform make
brew "cmake"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Pins GitHub Actions to full hashes and versions
brew "pinact"
# Fast, disk space efficient package manager
brew "pnpm"
# Theme for zsh
brew "powerlevel10k"
# Rust toolchain installer
brew "rustup"
# Blazing-fast modern Lua linter
brew "selene"
# Autoformat shell script source code
brew "shfmt"
# SKK dictionary maintenance tools
brew "skktools"
# Opinionated Lua code formatter
brew "stylua"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Vi 'workalike' with many additional features
brew "vim"
# Vim script Language Lint
brew "vint"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Agent orchestration platform
cask "antigravity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Web browser focusing on privacy
cask "brave-browser"
# AI-powered translator
cask "deepl"
# GNU Emacs text editor with patches for macOS
cask "d12frosted/emacs-plus/emacs-plus-app", trusted: true
cask "font-hackgen-nerd"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Get up and running with large language models locally
cask "ollama-app"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
