jorgebucaran/fisher
jethrokuan/fzf
decors/fish-ghq
yuys13/autols.fish
yuys13/gcd.fish
yuys13/pathed.fish
0rax/fish-bd
oh-my-fish/theme-bobthefish
